/**
 * keep-alive 组件的作用和原理（空间换时间，缓存在内存中）
 * keep-alive 组件是 vue 的内置组件，用于缓存内部组件实例。这样做的目的在于，keep-alive 内部的组件切回时，不用重新创建
 * 组件实例，而直接使用缓存中的实例，一方面能够避免创建组件带来的开销，另一方面可以保留组件的状态
 * 
 * keep-alive 具有 include 和 exclude 属性，通过它们可以控制哪些组件进入缓存。另外它还提供了 max 属性，通过它可以设置最大缓存数，
 * 当缓存的实例超过该数时，vue 会移除最久没有使用的组件缓存
 * 
 * 受 keep-alive 的影响，其内部所有嵌套的组件都具有两个生命周期钩子函数，分别是 activated 和 deactivated，它们分别在组件激活
 * 和失活时触发。第一次 activated 触发是在 mounted 之后
 * 
 * 在具体的实现上，keep-alive 在内部维护了一个 key 数组和一个缓存对象，key 数组记录目前缓存的组件 key 值，如果组件没有指定 key 值，
 * 则会为其自动生成一个唯一的 key 值
 * 
 * cache 对象以 key 值为键，vnode 为值，用于缓存组件对应的虚拟 dom，在 keep-alive 的渲染函数中，其基本逻辑是判断当前渲染的 vnode
 * 是否有对应的缓存，如果有，从缓存中读取到对应的组件实例，如果没有则将其缓存
 * 
 * 当缓存数量超过 max 数值时，keep-alive 会移除掉 key 数组的第一个元素
 */