const fs = require('fs')

setTimeout(() => {
  console.log("setTimeout")
}, 0)

fs.readFile('./18_事件循环.js', 'utf-8', () => {
  console.log("fs")
})

/**
 * Nodejs 中的事件循环，和浏览器环境的事件循环有何不同？ * 
 */
//  Nodejs 的时事件循环分为 6 个阶段：
// ┌───────────────────────┐
// │        Timers         │ < --setTimeout / setInterval
// └──────────┬────────────┘
//            ↓
// ┌───────────────────────┐
// │  Pending I / O Callbacks│ < --系统级异常回调
// └──────────┬────────────┘
//            ↓
// ┌───────────────────────┐
// │   Idle / Prepare        │ < --内部使用
// └──────────┬────────────┘
//            ↓
// ┌───────────────────────┐
// │        Poll           │ < --I / O 回调、计算阻塞时间
// └──────────┬────────────┘
//            ↓
// ┌───────────────────────┐
// │        Check          │ < --setImmediate
// └──────────┬────────────┘
//            ↓
// ┌───────────────────────┐
// │   Close Callbacks     │ < --关闭事件回调
// └───────────────────────┘